1-й Заозерний пров. 
вул. Бальзака 
1-й Скнилівський пров. 
вул. Бандрівського 
2-й Скнилівський пров. 
вул. Барвінських 
2-й Топольний пров. 
вул. Бахматюка 
3-й Скнилівський пров. 
вул. Бачинського 
3-й Топольний пров. 
вул. Баштанна 
4-й Скнилівський пров. 
вул. Бедржиха Сметани 
4-й Топольний пров. 
вул. Бережанська 
5-й Скнилівський пров. 
вул. Берестяна 
5-й Топольний пров. 
вул. Бернарда Меретина 
6-й Скнилівський пров. 
вул. Бетховена 
6-й Топольний пров. 
вул. Богдана Котика 
7-й Скнилівський пров. 
вул. Богдана Лепкого 
Албанська вул. 
вул. Богдана Хмельницького 
Аральська вул. 
вул. Богдана Януша 
Арктична вул. 
вул. Богдана-Ігоря Антонича 
Архітекторська вул. 
вул. Богданівська 
Банківська вул. 
вул. Боднарська 
Батуринська вул. 
вул. Бодянського 
Болгарська вул. 
вул. Бойківська 
Бруснівська вул. 
вул. Бориса Антоненка-Давидовича 
Брюховицька вул. 
вул. Бориса Романицького 
Бузинова вул. 
вул. Бориса Тена 
Буковинська вул. 
вул. Боровиковського 
Буська вул. 
вул. Ботанічна 
Бібліотечна вул. 
вул. Братня 
Велотраса "Вульки" 
вул. Братів Климових 
Весняна вул. 
вул. Братів Міхновських 
Випасова вул. 
вул. Братів Рогатинців 
Вихід на оглядовий майданчик на «Високому Замку» 
вул. Братів Тимошенків 
Вузька вул. 
вул. Бринського 
вул Броварна 
вул. Бродівська 
вул. Авраама Лінкольна 
вул. Бузкова 
вул. Авіаційна 
вул. Букова 
вул. Авґустина Волошина 
вул. Біберовича 
вул. Агабек-Заде 
вул. Біласа 
вул. Адама Коцька 
вул. Білогорща 
вул. Азовська 
вул. Білоруська 
вул. Академіка Богомольця 
вул. Білоцерківська 
вул. Академіка Андрія Сахарова 
вул. В'ячеслава Липинського 
вул. Академіка Володимира Філатова 
вул. Вагова 
вул. Академіка Кучера 
вул. Вагонна 
вул. Академіка Люльки 
вул. Валеріана Полiщука 
вул. Академіка Михайла Кравчука 
вул. Валова 
вул. Академіка Підстригача 
вул. Варшавська 
вул. Академіка Степана Рудницького 
вул. Васильченка 
вул. Академіка Філарета Колесси 
вул. Василя Григоровича 
вул. Академіка Євгена Лазаренка 
вул. Василя Дідушка 
вул. Академіка Івана Крип'якевича 
вул. Василя Жуковського 
вул. Академіка Івана Павлова 
вул. Василя Перова 
вул. Акакія Церетелі 
вул. Василя Сiмовича 
вул. Акацієва 
вул. Василя Симоненка 
вул. Алли Горської 
вул. Василя Стефаника 
вул. Алмазна 
вул. Василя Стуса 
вул. Алчевської 
вул. Василя Єрошенка 
вул. Алішера Навої 
вул. Вербова 
вул. Амвросія Бучми 
вул. Вербова 
вул. Анатолія Вахнянина 
вул. Вернигори 
вул. Анатолія Кос-Анатольського 
вул. Верхня Зимова 
вул. Ангарна 
вул. Весела 
вул. Андрія Волощака 
вул. Ветеранів 
вул. Андрія Мельника 
вул. Вечірня 
вул. Андрія П'ясецького 
вул. Вигода 
вул. Антона Головатого 
вул. Вигін 
вул. Антона Манастирського 
вул. Визвольна 
вул. Антона Чехова 
вул. Винниківська 
вул. Арсенальська 
вул. Винниця 
вул. Артема Веделя 
вул. Виноградна 
вул. Архівна 
вул. Високий замок 
вул. Бабія 
вул. Височана 
вул. Базальтова 
вул. Вишнева 
вул. Базарна 
вул. Вишнева 
вул. Бакинська 
вул. Водна 
вул. Балкова 
вул. Водогінна 
вул. Балтійська 
вул. Волинська 
вул. Володимира Антоновича 
вул. Грінченка 
вул. Володимира Великого 
вул. Гіацинтова 
вул. Володимира Вернадського 
вул. Гіпсова 
вул. Володимира Вернадського 
вул. Дальня 
вул. Володимира Винниченка 
вул. Данила Апостола 
вул. Володимира Гнатюка 
вул. Данила Танячкевича 
вул. Володимира Комарова 
вул. Демнянська 
вул. Володимира Короленка 
вул. Дениса Лукіяновича 
вул. Володимира Кубійовича 
вул. Дениса Лукіяновича 
вул. Володимира Навроцького 
вул. Джерельна 
вул. Володимира Самійленка 
вул. Джона Леннона 
вул. Володимира Янева 
вул. Джорджа Вашингтона 
вул. Володимира Івасюка 
вул. Джохара Дудаєва 
вул. Володимира Івасюка 
вул. Дзиндри 
вул. Волошкова 
вул. Дивізійна 
вул. Воля 
вул. Дитяча 
вул. Врубеля 
вул. Дмитра Бортнянського 
вул. Вугільна 
вул. Дмитра Вітовського 
вул. Вука Караджича 
вул. Дмитра Гуні 
вул. Вулецька 
вул. Дмитра Данилишина 
вул. Віктора Чукаріна 
вул. Дмитра Детька 
вул. Вільна 
вул. Дмитра Донцова 
вул. Вільхова 
вул. Дмитра Загула 
вул. Вірменська 
вул. Дмитра Карбишева 
вул. Вітряна 
вул. Дмитра Котка 
вул. Вічева 
вул. Дмитра Маївського 
вул. Газова 
вул. Дмитра Менделєєва 
вул. Гайдамацька 
вул. Дмитра Яворницького 
вул. Гайдучка 
вул. Дністерська 
вул. Гайова 
вул. Дозвільна 
вул. Галiлея 
вул. Долішня 
вул. Галицька 
вул. Доробок 
вул. Галицька 
вул. Дороша 
вул. Галицькі Пасіки 
вул. Дорошенка 
вул. Гамалії 
вул. Дрогобицька 
вул. Ганни Барвінок 
вул. Друкарська 
вул. Гарматія 
вул. Дріжджова 
вул. Гартмана Вітвера 
вул. Дублянська 
вул. Генерала Алмазова 
вул. Дубнівська 
вул. Генерала Віктора Курмановича 
вул. Дубова 
вул. Генерала Дмитра Грицая 
вул. Дунайська 
вул. Генерала Мирона Тарнавського 
вул. Духновича 
вул. Генерала Мирона Юнаківа 
вул. Дібровна 
вул. Генерала Олександра Грекова 
вул. Евгенія Озаркевича 
вул. Генерала Тараса Чупринки 
вул. Елізи Ожешко 
вул. Геннадія Кузнєвича 
вул. Енергетична 
вул. Геологів 
вул. Естонська 
вул. Георгія Нарбута 
вул. Ждахи 
вул. Героїв Крут 
вул. Житня 
вул. Героїв Майдану 
вул. Житомирська 
вул. Героїв УПА 
вул. Жовківська 
вул. Гетьмана Мазепи 
вул. Жовківська 
вул. Гетьмана Павла Полуботка 
вул. Журавлина 
вул. Глибока 
вул. Забава 
вул. Глиняна 
вул. Заклинських 
вул. Глухий Кут 
вул. Залізнична 
вул. Глібова 
вул. Залісна 
вул. Гната Хоткевича 
вул. Замарстинівська 
вул. Гнатевича 
вул. Замкова 
вул. Голинського 
вул. Заміська 
вул. Горбкова 
вул. Заозерна 
вул. Гординських 
вул. Запольської 
вул. Гордієнка 
вул. Запорізька 
вул. Городоцька 
вул. Зарицьких 
вул. Горіхова 
вул. Затишна 
вул. Гравійна 
вул. Збиральна 
вул. Гранітна 
вул. Зборівська 
вул. Грецька 
вул. Збоїща 
вул. Гречана 
вул. Зв'язкова 
вул. Григорія Граб`янки 
вул. Здоров'я 
вул. Григорія Квітки-Основ'яненка 
вул. Зелена 
вул. Григорія Петровського 
вул. Земельна 
вул. Григорія Смольського 
вул. Земельна 
вул. Грузинська 
вул. Зернова 
вул. Грушева 
вул. Зигзаг 
вул. Зимова 
вул. Крехівська 
вул. Зиновія Флінти 
вул. Кривчицька Дорога 
вул. Золота 
вул. Кримська 
вул. Зубрицького 
вул. Кримська 
вул. Зубрівська 
вул. Кругла 
вул. Зустрічна 
вул. Кругова 
вул. Йосафата Коциловського 
вул. Круп'ярська 
вул. Йосипа Сліпого 
вул. Кубанська 
вул. Кавказька 
вул. Кузнярівка 
вул. Каганця 
вул. Куликівська 
вул. Казахська 
вул. Кульпарківська 
вул. Каліча Гора 
вул. Кульчицької 
вул. Кам'янецька 
вул. Купальська 
вул. Каменярів 
вул. Купчинського 
вул. Канівська 
вул. Курильська 
вул. Капітана Білинського 
вул. Курортна 
вул. Караїмська 
вул. Кущова 
вул. Карла Брюллова 
вул. Лазнева 
вул. Карла Микльоша 
вул. Лебедина 
вул. Карла Россі 
вул. Лева Ганкевича 
вул. Кармелюка 
вул. Лева Трещаківського 
вул. Карпа Скидана 
вул. Лева Ґеца 
вул. Карпатська 
вул. Левандівська 
вул. Кастелівка 
вул. Левка Ревуцького 
вул. Каховська 
вул. Леоніда Перфецького 
вул. Качали 
вул. Леся Мартовича 
вул. Квітки Цісик 
вул. Леся Курбаса 
вул. Квітнева 
вул. Лесі Українки 
вул. Керамічна 
вул. Лижв'ярська 
вул. Керченська 
вул. Липова Алея 
вул. Кирила Трильовського 
вул. Листова 
вул. Кирила і Мефодія 
вул. Листопадна 
вул. Кирилівська 
вул. Листопадового Чину 
вул. Кишинівська 
вул. Литовська 
вул. Київська 
вул. Личаківська 
вул. Київська 
вул. Лодія 
вул. Клепарівська 
вул. Лонгина Цегельського 
вул. Кліматична 
вул. Лотоцького 
вул. Княгині Ольги 
вул. Луганська 
вул. Князя Льва 
вул. Лук'яна Кобилиці 
вул. Князя Мстислава Удатного 
вул. Лукасевича 
вул. Князя Романа 
вул. Луки Гарматія 
вул. Ковалевської 
вул. Луки Долинського 
вул. Козацька 
вул. Луцька 
вул. Козельницька 
вул. Льва Броварського 
вул. Козланюка 
вул. Льва Броварського 
вул. Коломийська 
вул. Льва Жемчужникова 
вул. Колоскова 
вул. Льва Толстого 
вул. Конвеєробудівників 
вул. Львівська 
вул. Кондукторська 
вул. Львівська 
вул. Конотопська 
вул. Львівська бічна 
вул. Конюшинна 
вул. Любінська 
вул. Копальна 
вул. Лютнева 
вул. Кордуби 
вул. Лікарська 
вул. Корейська 
вул. Лікувальна 
вул. Корецька 
вул. Лісна 
вул. Корольова 
вул. Лісна 
вул. Коротка 
вул. Ліська 
вул. Корсунська 
вул. Літня 
вул. Кортумівка 
вул. Магазинова 
вул. Коряцька 
вул. Майданна 
вул. Косинського 
вул. Майорівка 
вул. Космічна 
вул. Макаренка 
вул. Костя Левицького 
вул. Максима Залізняка 
вул. Костянтина Корнякта 
вул. Максима Кривоноса 
вул. Костянтина Острозького 
вул. Максима Рильського 
вул. Костянтини Малицької 
вул. Мала 
вул. Котлярська 
вул. Малехівська 
вул. Кочегарська 
вул. Мар'яна Панчишина 
вул. Кошиця 
вул. Марка Вовчка 
вул. Кошова 
вул. Марка Черемшини 
вул. Краківська 
вул. Мартироса Сар’яна 
вул. Краснянська 
вул. Марунька 
вул. Красовська 
вул. Марії Заньковецької 
вул. Кременецька 
вул. Марії Конопницької 
вул. Марії Мундяк 
вул. Мосяжна 
вул. Марії Слободівни 
вул. Мукачівська 
вул. Мацієвича 
вул. Мулярська 
вул. Машиністів 
вул. Мурави 
вул. Маєра Балабана 
вул. Мурашка 
вул. Медова 
вул. Мучна 
вул. Медової Печери 
вул. Мідна 
вул. Мележа Івана 
вул. Міхая Емінеску 
вул. Мелетія Смотрицького 
вул. На Сторожі 
вул. Металістів 
вул. На Четвертях 
вул. Метлинського 
вул. Нагірна 
вул. Метрологічна 
вул. Нагірних 
вул. Мечникова 
вул. Надійна 
вул. Микити Годованця 
вул. Назарука 
вул. Миклухо-Маклая 
вул. Народна 
вул. Микола Аркаса 
вул. Насипна 
вул. Миколая Коперника 
вул. Наступальна 
вул. Миколи Бенцаля 
вул. Насінна 
вул. Миколи Вороного 
вул. Наталії Кобринської 
вул. Миколи Гоголя 
вул. Наукова 
вул. Миколи Голубця 
вул. Нафтова 
вул. Миколи Зерова 
вул. Незалежності 
вул. Миколи Кибальчича 
вул. Нечая 
вул. Миколи Костомарова 
вул. Нижня Зимова 
вул. Миколи Лемика 
вул. Низинна 
вул. Миколи Леонтовича 
вул. Низький Замок 
вул. Миколи Лисенка 
вул. Нова 
вул. Миколи Лобачевського 
вул. Новий Світ 
вул. Миколи Лукаша 
вул. Новознесенська 
вул. Миколи Некрасова 
вул. Ніжинська 
вул. Миколи Пимоненка 
вул. Ніщинського 
вул. Миколи Садовського 
вул. Оглоблина 
вул. Миколи Скрипника 
вул. Огіркова 
вул. Миколи Устияновича 
вул. Озерна 
вул. Миколи Хвильового 
вул. Околична 
вул. Мила 
вул. Окружна 
вул. Милорадович 
вул. Окуневського 
вул. Милятинська 
вул. Олександра Архипенка 
вул. Миргородська 
вул. Олександра Герцена 
вул. Мирослава Ірчана 
вул. Олександра Довженка 
вул. Митрополита Ангеловича 
вул. Олександра Засядька 
вул. Митрополита Андрея 
вул. Олександра Козловського 
вул. Митрополита Липківського 
вул. Олександра Кониського 
вул. Михайла Бойчука 
вул. Олександра Мишуги 
вул. Михайла Гайворонського 
вул. Олександра Олеся 
вул. Михайла Глінки 
вул. Олександра Фредра 
вул. Михайла Грушевського 
вул. Олександра Чоловського 
вул. Михайла Драгана 
вул. Олександра Шумського 
вул. Михайла Драгоманова 
вул. Олекси Довбуша 
вул. Михайла Драй-Хмари 
вул. Олекси Гірника 
вул. Михайла Козика 
вул. Олекси Новаківського 
вул. Михайла Коцюбинського 
вул. Олекси Стороженка 
вул. Михайла Кричевського 
вул. Олексія Венеціанова 
вул. Михайла Лучкая 
вул. Олени Пчілки 
вул. Михайла Максимовича 
вул. Олени Степанівни 
вул. Михайла Павлика 
вул. Олени Теліги 
вул. Михайла Паращука 
вул. Олесницького 
вул. Михайла Старицького 
вул. Олешківська 
вул. Михайла Туган-Барановського 
вул. Ольги Басараб 
вул. Михайла Щепкіна 
вул. Ольги Дучимінської 
вул. Михайла Яцкова 
вул. Ольги Кобилянської 
вул. Михальчука 
вул. Ольжича 
вул. Михаїла Вербицького 
вул. Олійна 
вул. Мови Василя 
вул. Омеляна Ковча 
вул. Могильницького 
вул. Опанаса Сластіона 
вул. Модеста Менцинського 
вул. Орельська 
вул. Модеста Сосенка 
вул. Орлина 
вул. Молдавська 
вул. Осипа Маковея 
вул. Молодіжна 
вул. Осипа Сорохтея 
вул. Молочна 
вул. Осипа Турянського 
вул. Моринецька 
вул. Оскара Кольберґа 
вул. Морозенка 
вул. Остапа Луцького 
вул. Морозна 
вул. Остапа Нижанківського 
вул. Моршинська 
вул. Остапа Терлецького 
вул. Мостова 
вул. Остроградських 
вул. Отця Іздрика 
вул. Професора Яреми 
вул. Очаківська 
вул. Пташина 
вул. Очеретяна 
вул. Пустомитівська 
вул. Павла Грабовського 
вул. Пшенична 
вул. Павла Ковжуна 
вул. Під Голоском 
вул. Павла Римлянина 
вул. Під Дубом 
вул. Павла Чубинського 
вул. Під Осовою 
вул. Памви Беринди 
вул. Підвальна 
вул. Панаса Мирного 
вул. Підгаєцька 
вул. Панаса Саксаганського 
вул. Підгірна 
вул. Пантелеймона Куліша 
вул. Підзамче 
вул. Панча 
вул. Підмурна 
вул. Паньківського 
вул. Пілотів 
вул. Папарівка 
вул. Піскова 
вул. Папоротна 
вул. Піша 
вул. Параджанова 
вул. Радехівська 
вул. Паркова 
вул. Радість 
вул. Паркова 
вул. Райдужна 
вул. Парфановичів 
вул. Ранкова 
вул. Пасічна 
вул. Рахівська 
вул. Пекарська 
вул. Рене Декарта 
вул. Перемиська 
вул. Рибна 
вул. Перехід 
вул. Рилеєва 
вул. Персенківка 
вул. Робітнича 
вул. Петра Войтовича 
вул. Роксоляни 
вул. Петра Гулака-Артемовського 
вул. Романа Дашкевича 
вул. Петра Дорошенка 
вул. Романа Сушка 
вул. Петра Калнишевського 
вул. Романа Шухевича 
вул. Петра Карманського 
вул. Романчука 
вул. Петра Карманського 
вул. Ромашкова 
вул. Петра Карманського 
вул. Ромоданівська 
вул. Петра Могили 
вул. Рослинна 
вул. Петра Полтави 
вул. Рубінова 
вул. Петра Сагайдачного 
вул. Рудакі 
вул. Петра Чайковського 
вул. Рудненська 
вул. Петрицького 
вул. Русових 
вул. Пилипа Орлика 
вул. Руська 
вул. Пильникарська 
вул. Рядова 
вул. Пирогівка 
вул. Ряснянська 
вул. Планерна 
вул. Ряшівська 
вул. Пластова 
вул. Рівна 
вул. Плетенецького 
вул. Різьбярська 
вул. Плугова 
вул. Річицька 
вул. Плугова 
вул. Садибна 
вул. Пляжна 
вул. Садова 
вул. Поворотна 
вул. Садівнича 
вул. Повстанська 
вул. Саковича 
вул. Повітряна 
вул. Самарська 
вул. Погулянка 
вул. Самбірська 
вул. Погулянка 
вул. Самійла Величка 
вул. Погідна 
вул. Сарненська 
вул. Подолинського 
вул. Свидницького 
вул. Пожежників 
вул. Свободи 
вул. Покутська 
вул. Світанкова 
вул. Полтв'яна 
вул. Себастіана Кльоновича 
вул. Полуднева 
вул. Севастопольська 
вул. Полунична 
вул. Северина Наливайка 
вул. Польова 
вул. Селищна 
вул. Політехнічна 
вул. Сельських 
вул. Поперечна 
вул. Семена Палія 
вул. Порохова 
вул. Сеньковича 
вул. Порічкова 
вул. Серафима Кушевича 
вул. Потебні 
вул. Сербська 
вул. Потелицька 
вул. Сергія Боткіна 
вул. Потічок 
вул. Сергія Васильківського 
вул. Почаївська 
вул. Сергія Литвиненка 
вул. Поштова 
вул. Сергія Євського 
вул. Приколійова 
вул. Сергія Єфремова 
вул. Природна 
вул. Сигнальна 
вул. Прогулкова 
вул. Сигнівка 
вул. Промислова 
вул. Сидора Воробкевича 
вул. Просвіти 
вул. Сидора Голубовича 
вул. Проста 
вул. Сильвестра Гавришкевича 
вул. Професора Петра Буйка 
вул. Сильвестра Гавришкевича 
вул. Професора Юліана Медведецького 
вул. Симона Петлюри 
вул. Синявського 
вул. Таманська 
вул. Сихівська 
вул. Тараса Шевченка 
вул. Скельна 
вул. Тарасівська 
вул. Скляна 
вул. Татарбунарська 
вул. Сковороди 
вул. Татарська 
вул. Сливова 
вул. Творча 
вул. Сливова 
вул. Театральна 
вул. Слобідська 
вул. Темницьких 
вул. Слюсарська 
вул. Теофіля Комаринця 
вул. Смерекова 
вул. Теофіля Копистинського 
вул. Смолиста 
вул. Теребовлянська 
вул. Сміла 
вул. Тернопільська 
вул. Сміливих 
вул. Тершаковців 
вул. Снопківська 
вул. Тесленка 
вул. Соколина 
вул. Тиверська 
вул. Сокільницька 
вул. Тичини 
вул. Солов'їна 
вул. Ткацька 
вул. Солодова 
вул. Топольна 
вул. Солом'янка 
вул. Торгова 
вул. Соломона Ляйнберга 
вул. Торф'яна 
вул. Соломії Крушельницької 
вул. Тракт Глинянський 
вул. Соляк 
вул. Трещаківського 
вул. Сомокиша 
вул. Тролейбусна 
вул. Сонячна 
вул. Трускавецька 
вул. Соняшникова 
вул. Туркменська 
вул. Сороки 
вул. Тучапського 
вул. Соснова 
вул. Тюльпанова 
вул. Соснова 
вул. Тютюнників 
вул. Сосюри 
вул. Тісна 
вул. Спадиста 
вул. Угорська 
вул. Спокійна 
вул. Ударна 
вул. Спокійна 
вул. Ужгородська 
вул. Сріблиста 
вул. Уласа Самчука 
вул. Ставропігійська 
вул. Уляни Кравченко 
вул. Стадників 
вул. Уманська 
вул. Станційна 
вул. Університетська 
вул. Станція Личаків 
вул. Урожайна 
вул. Станіслава Людкевича 
вул. Ф. Черника 
вул. Стара 
вул. Федора Вовка 
вул. Староміська 
вул. Ференца Ліста 
вул. Староєврейська 
вул. Фещенка-Чопівського 
вул. Степана Бандери 
вул. Франтішека Ржегоржа 
вул. Степана Ковалева 
вул. Франциска Скорини 
вул. Степана Руданського 
вул. Францішка Карпінського 
вул. Степана Смаль-Стоцького 
вул. Фредеріка Шопена 
вул. Степана Томашівського 
вул. Фурманська 
вул. Степового 
вул. Харківська 
вул. Стефана Банаха 
вул. Хлібна 
вул. Стеценка 
вул. Холмська 
вул. Стрийська 
вул. Холодноярська 
вул. Стрімка 
вул. Хорватська 
вул. Студентська 
вул. Хоробрих 
вул. Студинського 
вул. Хортицька 
вул. Сумська 
вул. Христофора Колумба 
вул. Суха 
вул. Хрісто Ботєва 
вул. Сухомлинського 
вул. Художня 
вул. Сушкевича 
вул. Хуторівка 
вул. Сушко-Скачківської 
вул. Хімічна 
вул. Сходова 
вул. Цетнерівка 
вул. Східна 
вул. Циганівка 
вул. Сяйво 
вул. Чагарникова 
вул. Сянська 
вул. Червона 
вул. Сім'ї Крушельницьких 
вул. Черемхова 
вул. Сінна 
вул. Черешнева 
вул. Сірка 
вул. Чернеча гора 
вул. Січинського 
вул. Чернеча Гора 
вул. Січнева 
вул. Чернівецька 
вул. Січова 
вул. Чернігівська 
вул. Січових Стрільців 
вул. Чечета 
вул. Січових Стрільців 
вул. Чигиринська 
вул. Т. Масарика 
вул. Чижевського 
вул. Табірна 
вул. Чикаленка 
вул. Тадеуша Бой-Желенського 
вул. Чорноморська 
вул. Тадеуша Костюшка 
вул. Чуваська 
вул. Таллінська 
вул. Шафарика 
вул. Шахтарська 
вул. Івана Миколайчука 
вул. Шведська 
вул. Івана Нечуя-Левицького 
вул. Шевська 
вул. Івана Огієнка 
вул. Шевченка 
вул. Івана Пулюя 
вул. Шептицьких 
вул. Івана Піддубного 
вул. Широка 
вул. Івана Раковського 
вул. Широка 
вул. Івана Репіна 
вул. Шкрібляків 
вул. Івана Рубчака 
вул. Шкільна 
вул. Івана Рутковича 
вул. Шкіряна 
вул. Івана Севери 
вул. Шолом-Алейхема 
вул. Івана Стешенка 
вул. Шота Руставелі 
вул. Івана Сулими 
вул. Шпитальна 
вул. Івана Сєченова 
вул. Шполянська 
вул. Івана Тиктора 
вул. Шімзерів 
вул. Івана Тобілевича 
вул. Щекавицька 
вул. Івана Труша 
вул. Щирецька 
вул. Івана Федорова 
вул. Щоголева 
вул. Івана Франка 
вул. Щурата 
вул. Івана Чмоли 
вул. Юліана Буцманюка 
вул. Івана Шараневича 
вул. Юліана Захаревича 
вул. Іванни Блажкевич 
вул. Юліана Опільського 
вул. Іларіона Свєнціцького 
вул. Юліуша Словацького 
вул. Іллі Кокорудза 
вул. Юрія Дрогобича 
вул. Ільмова 
вул. Юрія Кондратюка 
вул. Інструментальна 
вул. Юрія Липи 
вул. Ірини Вільде 
вул. Юрія Мушака 
вул. Ґалас Діаманди 
вул. Юрія Федьковича 
вул. Ґрунтова 
вул. Яблунева 
Вівсяна вул. 
вул. Яблунева 
Відкрита вул. 
вул. Яворівська 
Городницька вул. 
вул. Якова Гніздовського 
Горіхова вул. 
вул. Якова Головацького 
Грибова вул. 
вул. Якова Остряниці 
Грушева вул. 
вул. Якова Раппопорта 
Грюнвальдська вул. 
вул. Яловець 
Гуцульська вул. 
вул. Яна Жижки 
Дагестанська вул. 
вул. Яна Матейка 
Диктова вул. 
вул. Янки Купали 
Дніпровська вул. 
вул. Яніса Райніса 
Довга вул. 
вул. Японська 
Довга вул. 
вул. Яричівська 
Донецька вул. 
вул. Ярослава Гашека 
Доступна вул. 
вул. Ярослава Мудрого 
Жасминова вул. 
вул. Ярослава Музики 
Жнивна вул. 
вул. Ярослава Пастернака 
Заболотівська вул. 
вул. Ярослава Пстрака 
Заводська вул. 
вул. Ярослава Стецька 
Загородня вул. 
вул. Ярослава Ярославенка 
Загірна вул. 
вул. Ясна 
Замкнена вул. 
вул. Ясна 
Заповітна вул. 
вул. Євгена Коновальця 
Зоряна вул. 
вул. Євгена Гребінки 
Камінна вул. 
вул. Євгена Патона 
Каштанова вул. 
вул. Євгена Плужника 
Квітова вул. 
вул. Євгена Поповича 
Китайська вул. 
вул. Євгенії Ярошинської 
Княжа вул. 
вул. І. Лукича 
Кобзарська вул. 
вул. Івана Левинського 
Ковельська вул. 
вул. Івана Айвазовського 
Колісна вул. 
вул. Івана Багряного 
Кооперативна вул. 
вул. Івана Боберського 
Кравецька вул. 
вул. Івана Богуна 
Краківський ряд 
вул. Івана Вагилевича 
Кривчицька дорога 
вул. Івана Величковського 
Кукурудзяна вул. 
вул. Івана Верхратського 
Кутова вул. 
вул. Івана Виговського 
Кінцева вул. 
вул. Івана Вишенського 
Ланова вул. 
вул. Івана Гонти 
Лемківська вул. 
вул. Івана Горбачевського 
Ливарна вул. 
вул. Івана Гушалевича 
Липнева пл. 
вул. Івана Кавалерідзе 
Лисинецька вул. 
вул. Івана Карпинця 
Ловецька вул. 
вул. Івана Копача 
Лугова вул. 
вул. Івана Котляревського 
Льняна вул. 
Лірницька вул. 
Похила вул. 
Лісова дорога Пасічна-Личаківська 
Прилуцька вул. 
М 06 (E471) 
Приязна вул. 
М 10 (Е 40) 
пров. Параджанова 
М-06 (E40) 
Пропелерна вул. 
М-09 (E372) 
просп. В'ячеслава Чорновола 
Малоголосківська вул. 
просп. Свободи 
Меблярська вул. 
просп. Тараса Шевченка 
Механічна вул. 
просп. Червоної Калини 
Мирна вул. 
Професорська вул. 
Мисливська вул. 
проїзд Автобудівельників 
Митна пл. 
проїзд Крива Липа 
Моторна вул. 
Півколо 
Музейна вул. 
Підлісна вул. 
Музейна пл. 
Підміська вул. 
Мурована вул. 
Резедова вул. 
Міжгірна вул. 
Реміснича вул. 
Міртова вул. 
Розлога вул. 
Міуська вул. 
Розточчя вул. 
Нарцисова вул. 
Рубінова 
Немирівська вул. 
Рясненська вул. 
Низова вул. 
Рівненська вул. 
Нова 
Рільнича вул. 
Нова вул. 
Садова вул. 
Одеська вул. 
Садова вул. 
Ожинова вул. 
Санітарна вул. 
Опришківська вул. 
Світла вул. 
Освицька вул. 
Селянська вул. 
Паркова алея 
Селянський ряд 
Паркова доріжка 
Скромна вул. 
Перекопська вул. 
Скісна вул. 
Переяславська вул. 
Слов'янська вул. 
Пильникарська вул. 
Сніжна вул. 
пл. 700-річчя Львова 
Сонячна вул. 
пл. Адама Міцкевича 
Сорочинська вул. 
пл. Василя Вишиванного 
Ставова вул. 
пл. Вічева 
Старознесенська вул. 
пл. Галицька 
Стежка на гуртовий ринок «Шувар» 
пл. Генерала Григоренка 
Стежка, що з'єднує вул. Замарстинівську і Голосківський цвинтар 
пл. Данила Галицького 
Стежка-просіка в Брюховицькому лісі 
пл. Двірцева 
Стрийський парк 
пл. Звенигородська 
Струмок вул. 
пл. Катедральна 
Стрілецька вул. 
пл. Князя Святослава 
Суботівська вул. 
пл. Коліївщини 
Судова вул. 
пл. Марка Кропивницького 
Т-14-16 
пл. Маркіяна Шашкевича 
Таджицька вул. 
пл. Олекси Гасина 
Творча вул. 
пл. Ринок 
Технічна вул. 
пл. Різні 
Тиха вул. 
пл. Св. Теодора 
Тунельна вул. 
пл. св. Юра 
Турецька вул. 
пл. Соборна 
Угнівська вул. 
пл. Старий Ринок 
Узбецька вул. 
пл. Стефана Яворського 
Фабрична вул. 
пл. Ярослава Осмомисла 
Хотинська вул. 
пл. Євгена Маланюка 
Цехова вул. 
пл. Євгена Петрушевича 
Черемхова вул. 
пл. Івана Підкови 
Черкаська вул. 
Плетенецького вул. 
Чумацька вул. 
Площа Святого Теодора 
Щепова вул. 
Польна вул. 
Ялтинська вул. 
Польова вул. 
Ярова вул. 
Поліська вул. 
vulytsia Bohdana Khmelnytskoho 
Порічкова вул. 
